app/controllers/questions_controller.rb

SELECT * FROM `questions` WHERE (user_id is not null) ORDER BY created_at DESC LIMIT 10
---
  def index
    @questions = Question.find(:all, :conditions => "user_id is not null", :order => "created_at DESC", :limit => 10)